gamerbank_api/app/controllers/gamers_controller.rb

SELECT "gamers".* FROM "gamers"
---
  def index
    @gamers = Gamer.all

INSERT INTO "gamers" ("title", "genre", "platform", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @gamer = Gamer.new(gamer_params)

    if @gamer.save

DELETE FROM "gamers" WHERE "gamers"."id" = $1  [["id", 18]]
---
  def destroy
    @gamer.destroy

SELECT "gamers".* FROM "gamers" WHERE "gamers"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
---
    def set_gamer
      @gamer = Gamer.find(params[:id])